welcome = "Привіт! Мене звати Дейв (smiley). Я віртуальний помічник викладача та адміністратор ОС AIX (TV)."

hello_message = "Бот для керування Workload Partitions ОС AIX (TV)."

siri_message = "Будь-ласка перевірте текст, який розпізнав голосовий помічник Siri (robot) та натисніть Enter (pointer)."

hint = "(paperclip) Будь-ласка опиши свою проблему нижче, або скористайся меню."

sign_in = "Для того, щоб увійти у свій особистий кабінет пройдіть аутентифікацію за допомогою навчальної платформи Moodle (lock). Для перевірки " \
          "треба надати свій номер мобільного телефону та e-mail (telephone)."

mail_validation = "На вашу пошту відправлено лист, будь-ласка введіть 7-значний код підтвердження нижче (letter): "

help = "Чат-бот для керування Workload Partitions у ОС AIX (TV). Опиши свою проблему нижче, або скористайся меню (nerd)."

schedule = "Лабораторна група 1: \n"\
                "\tпон, сер: 14:05-16:40\n"\
                "Лабораторна група 2\n"\
                "\tвівт, п'ятн: 12:20-13:55\n\n"\
                "Графік складання лабораторних робіт:\n"\
                "Лабораторна робота №1 - 3 лютого - 14 лютого\n"\
                "Лабораторна робота №2 - 17 лютого - 28 лютого\n"\
                "Лабораторна робота №3 - 2 березня - 13 березня\n"\
                "Лабораторна робота №4 - 16 березня - 27 березня\n"\
                "Лабораторна робота №5 - 30 березня - 10 квітня\n"\
                "Лабораторна робота №6 - 13 квітня - 24 квітня\n"\
                "Лабораторна робота №7 - 27 квітня - 8 травня\n"\
                "До складання боргів - 11 травня - 22 травня\n\n"\
                "Залік - 25 травня 2020"

requirements =  "Вимоги до звіту з лабораторної роботи: \n"\
                "1) Звіт має бути обов'язково підписаний (містити прізвище та ім'я студента);\n"\
                "2) Шрифт: Times New Roman, розмір: 14, інтервал: 1.5;\n"\
                "3) Звіт має бути збереженим у форматі .pdf, розмір має бути не більше 2МБ;\n"\
                "4) Звіт має бути обов'язково завантаженим у систему Moodle Education;\n"\
                "5) Звіт має містити скріншоти виконання лабораторної роботи, сценаріїв та команд;\n"\
                "6) За сдачу не свого звіту за виконання лабораторної роботи ставиться 0 балів;\n"\
                "7) За не вчасну здачу лабораторної роботи за кожну неділю знімається 2 бали."

connect_ssh = "Для підключення до AIX віртуальної машини треба: \n"\
              "1) Завантажити PuTTY або будь-який інший ssh клієнт;\n"\
              "2) Треба у поле Host Name написати наступне _login@ipAddress_, де _login_ - ваш логін, а _ipAddress_ - ip адрес вашого WPAR (10.0.41.X);\n"\
              "3) Натиснути кнопку Open (для підключення)."

interesting_facts = ["Перша версія ОС AIX (Advanced Interactive eXecutive англ. /ˌeɪaɪˈɛks/) вийшла у 1986 році (time) та мала назву AIX/RT 2. "\
                     "Вона була побудованана базі UNIX System V (hammer).",

                     "У ОС AIX є помічник SMIT (System Management Interface Tool). З його допомогою можна не вводити довгі команди з великою кількістю "\
                     "аргументів (wink). Помічник SMIT представлений у графічному інтерфейсі, у Web-застосуванні та у командному рядку. Він значно полегшує "\
                     "роботу з ОС AIX та пришвидшує її адміністрування (happy). Без нього це б було робити набагато складніше (exhausted). Для того, щоб запустити помічник "\
                     "SMIT у командному рядку треба виконати команду smitty або smit -c (run).",

                     "У ОС AIX є графічна оболонка, вона має назву CDE (Common Desktop Environment) (koala). Тривалий час була вона була класичною графічною оболонкою"\
                     "для ОС Unix (time). Але з часом у більшості ОС Unix була замінена на графічні оболонки GNOME та KDE (shark).",

                     "Згідно даних компанії \"Enlyft\" (https://enlyft.com/tech/products/ibm-aix) ОС AIX у світі використовує 9,433 компанія (smiley) (це скаладає "\
                     "0,47% від інших операційних систем (surprised)).",

                     "У ОС AIX є своя технологія віртуалізації (hammer), вона називається WPAR (Workload Partitions) (happy). Вона підтримується у ОС AIX v.6.1 та вище (penguin)."]

labs_and_links = { 1: "https://drive.google.com/file/d/1kRq5fmN-wINjBuxDN6hmm4EsQ3I_FLi8/view?usp=sharing",
                   2: "https://drive.google.com/file/d/1hGwd5RDr4JoFCjK9e8r0AZrqNLXN7irE/view?usp=sharing",
                   3: "https://drive.google.com/file/d/1QFDP9wbosKtVpohAzqeWz2kEDyJbIMKN/view?usp=sharing",
                   4: "https://drive.google.com/file/d/1q-qu8N54GU_xlXGgTob64Y5pM26J4RNm/view?usp=sharing",
                   5: "https://drive.google.com/file/d/1lmv07r3PLgtEHhoWQKFpadF5z0bS_X-C/view?usp=sharing",
                   6: "https://drive.google.com/file/d/1JF61tUmlc4y397-4nAfYLaAmKfYs1cTE/view?usp=sharing",
                   7: "https://drive.google.com/file/d/1ZjaHuOvCq4HJ04wQOGK09LeQukqhwSqF/view?usp=sharing"}

error_registration = 'Ви не зареєстровані у курсі "Програмування для UNIX-систем" (!) Будь-ласка, зареєструйтеся у навчальній платформі Moodle (checkmark) та зв\'яжіться з вашим'\
               ' викладачем, щоб він додав вас до курсу (pig).'